MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/mk53dn512clq10.s
    .weak      RTC_Seconds_IRQHandler
    .thumb_set RTC_Seconds_IRQHandler,Default_Handler

    .weak      PIT0_IRQHandler
    .thumb_set PIT0_IRQHandler,Default_Handler

    .weak      PIT1_IRQHandler
    .thumb_set PIT1_IRQHandler,Default_Handler

    .weak      PIT2_IRQHandler
    .thumb_set PIT2_IRQHandler,Default_Handler

    .weak      PIT3_IRQHandler
    .thumb_set PIT3_IRQHandler,Default_Handler

    .weak      PDB0_IRQHandler
    .thumb_set PDB0_IRQHandler,Default_Handler

    .weak      USB0_IRQHandler
    .thumb_set USB0_IRQHandler,Default_Handler

    .weak      USBDCD_IRQHandler
    .thumb_set USBDCD_IRQHandler,Default_Handler

    .weak      ENET_1588_Timer_IRQHandler
    .thumb_set ENET_1588_Timer_IRQHandler,Default_Handler

    .weak      ENET_Transmit_IRQHandler
    .thumb_set ENET_Transmit_IRQHandler,Default_Handler

    .weak      ENET_Receive_IRQHandler
    .thumb_set ENET_Receive_IRQHandler,Default_Handler

    .weak      ENET_Error_IRQHandler
    .thumb_set ENET_Error_IRQHandler,Default_Handler

    .weak      Reserved95_IRQHandler
    .thumb_set Reserved95_IRQHandler,Default_Handler

    .weak      SDHC_IRQHandler
    .thumb_set SDHC_IRQHandler,Default_Handler

    .weak      DAC0_IRQHandler
    .thumb_set DAC0_IRQHandler,Default_Handler

    .weak      DAC1_IRQHandler
    .thumb_set DAC1_IRQHandler,Default_Handler

    .weak      TSI0_IRQHandler
    .thumb_set TSI0_IRQHandler,Default_Handler

    .weak      MCG_IRQHandler
    .thumb_set MCG_IRQHandler,Default_Handler

    .weak      LPTMR0_IRQHandler
    .thumb_set LPTMR0_IRQHandler,Default_Handler

    .weak      LCD_IRQHandler
    .thumb_set LCD_IRQHandler,Default_Handler

    .weak      PORTA_IRQHandler
    .thumb_set PORTA_IRQHandler,Default_Handler

    .weak      PORTB_IRQHandler
    .thumb_set PORTB_IRQHandler,Default_Handler

    .weak      PORTC_IRQHandler
    .thumb_set PORTC_IRQHandler,Default_Handler

    .weak      PORTD_IRQHandler
    .thumb_set PORTD_IRQHandler,Default_Handler

    .weak      PORTE_IRQHandler
    .thumb_set PORTE_IRQHandler,Default_Handler

    .weak      Reserved108_IRQHandler
    .thumb_set Reserved108_IRQHandler,Default_Handler

    .weak      Reserved109_IRQHandler
    .thumb_set Reserved109_IRQHandler,Default_Handler

    .weak      SWI_IRQHandler
    .thumb_set SWI_IRQHandler,Default_Handler

    .weak      Reserved111_IRQHandler
    .thumb_set Reserved111_IRQHandler,Default_Handler

    .weak      Reserved112_IRQHandler
    .thumb_set Reserved112_IRQHandler,Default_Handler

    .weak      Reserved113_IRQHandler
    .thumb_set Reserved113_IRQHandler,Default_Handler

    .weak      Reserved114_IRQHandler
    .thumb_set Reserved114_IRQHandler,Default_Handler

    .weak      Reserved115_IRQHandler
    .thumb_set Reserved115_IRQHandler,Default_Handler

    .weak      Reserved116_IRQHandler
    .thumb_set Reserved116_IRQHandler,Default_Handler

    .weak      Reserved117_IRQHandler
    .thumb_set Reserved117_IRQHandler,Default_Handler

    .weak      Reserved118_IRQHandler
    .thumb_set Reserved118_IRQHandler,Default_Handler

    .weak      Reserved119_IRQHandler
    .thumb_set Reserved119_IRQHandler,Default_Handler
